/**
 * desc: 1021.发放奖金
 * author: yinsuhu
 * date: 2019.11.21
 */
#include<iostream>
#include<iomanip>
using namespace std;
int main() {
    double p, s;
    cin >> p;
    if(p <= 100000) {
        s = p * 0.1;
    } else if(p <= 200000) {
        s = 100000 * 0.1 + (p-100000) * 0.075;
    } else if(p <= 400000) {
        s = 100000 * 0.1 + 100000 * 0.075 + (p-200000) * 0.05;
    } else if(p <= 600000) {
        s = 100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05 + (p-400000) * 0.03;
    } else if(p <= 1000000) {
        s = 100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05 + 200000 * 0.03 + (p-600000) * 0.015;
    } else {
        s = 100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05 + 200000 * 0.03 + 400000 * 0.015 + (p-1000000) * 0.01;
    }
    cout << fixed << setprecision(3) << s << endl;
    return 0;
}
